LabelLineLength Property
 The length of the viewport label line in sheet space, measured in feet.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  Since:  2022
 Syntax
  C#
public double LabelLineLength { get; set; }
  Visual Basic
Public Property LabelLineLength As Double
	Get
	Set
  Visual C++
public:
property double LabelLineLength {
	double get ();
	void set (double value);
}
 Remarks
 It can be negative. The sign depends on the direction of the label line.
 See Also
  Viewport Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →